Masmiseim36/nxpSDK/boards/evkmimxrt1180/bootloader_examples/flashloader/cm33/pin_mux.h
/*
 * Copyright 2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AON_09 (coord A5), RX */
/* Routed pin properties */
#define UART1_POLLFORACTIVITY_RX_GPIO_PERIPHERAL                          RGPIO1   /*!< Peripheral name */
#define UART1_POLLFORACTIVITY_RX_GPIO_SIGNAL                             gpio_io   /*!< Signal name */
#define UART1_POLLFORACTIVITY_RX_GPIO_CHANNEL                                 9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define UART1_POLLFORACTIVITY_RX_GPIO_GPIO                                RGPIO1   /*!< GPIO peripheral base pointer */
#define UART1_POLLFORACTIVITY_RX_GPIO_GPIO_PIN                                9U   /*!< GPIO pin number */
#define UART1_POLLFORACTIVITY_RX_GPIO_GPIO_PIN_MASK                   (1U << 9U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_PollForActivity(void);             /* Function assigned for the Cortex-M33 */

/* GPIO_AON_09 (coord A5), RX */
/* Routed pin properties */
#define UART1_INITPINS_RX_PERIPHERAL                                     LPUART1   /*!< Peripheral name */
#define UART1_INITPINS_RX_SIGNAL                                             RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_InitPins(void);                    /* Function assigned for the Cortex-M33 */

/* GPIO_AON_09 (coord A5), RX */
/* Routed pin properties */
#define UART1_RESTOREDEFAULT_RX_PERIPHERAL                                RGPIO1   /*!< Peripheral name */
#define UART1_RESTOREDEFAULT_RX_SIGNAL                                   gpio_io   /*!< Signal name */
#define UART1_RESTOREDEFAULT_RX_CHANNEL                                       9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define UART1_RESTOREDEFAULT_RX_GPIO                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define UART1_RESTOREDEFAULT_RX_GPIO_PIN                                      9U   /*!< GPIO pin number */
#define UART1_RESTOREDEFAULT_RX_GPIO_PIN_MASK                         (1U << 9U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART1_RestoreDefault(void);              /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_InitPins(void);                     /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_RestoreDefault(void);               /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
